namespace HotelsBigDataGenerator.Services
{
    public static class DataConstants
    {
        // Имена и фамилии
        public static readonly string[] FirstNames = {
            "Иван", "Александр", "Мария", "Елена", "Дмитрий", "Анна", "Сергей", "Ольга", "Андрей", "Татьяна",
            "Николай", "Екатерина", "Михаил", "Светлана", "Владимир", "Юлия", "Павел", "Наталья", "Алексей", "Ирина"
        };
        public static readonly string[] LastNames = {
            "Иванов", "Петров", "Сидоров", "Кузнецов", "Смирнов", "Попов", "Васильев", "Морозов", "Николаев", "Захаров",
            "Григорьев", "Федоров", "Михайлов", "Ковалев", "Белов", "Комаров", "Лебедев", "Новиков", "Козлов", "Степанов"
        };

        // Города и страны
        public static readonly string[] Cities = {
            "Москва", "Санкт-Петербург", "Новосибирск", "Екатеринбург", "Казань", "Нижний Новгород", "Челябинск", "Самара", "Уфа", "Ростов-на-Дону",
            "Омск", "Красноярск", "Воронеж", "Пермь", "Волгоград", "Краснодар", "Саратов", "Тюмень", "Тольятти", "Ижевск"
        };
        public static readonly string[] Countries = {
            "Россия", "Беларусь", "Казахстан", "Германия", "Франция", "Италия", "Испания", "США", "Китай",
            "Япония", "Канада", "Австралия", "Бразилия", "Индия", "Южная Корея", "Турция", "Аргентина", "Мексика", "Швеция"
        };

        // Адреса
        public static readonly string[] Addresses = {
            "ул. Ленина, 1", "пр. Победы, 25", "ул. Мира, 45", "ул. Свободы, 12", "ул. Центральная, 33", "ул. Октябрьская, 7",
            "ул. Советская, 15", "ул. Заречная, 9", "бульвар Космонавтов, 3", "пер. Гагарина, 8"
        };

        // Названия отелей
        public static readonly string[] HotelNames = {
            "Grand Hotel", "Royal Palace", "Sunset Resort", "Ocean View", "Mountain Lodge", "City Inn", "Skyline Hotel", "Forest Retreat", "Riverfront Suites", "Golden Crown",
            "Luxury Haven", "Seaside Paradise", "Alpine Escape", "Urban Oasis", "Emerald Bay", "Diamond Plaza", "Sapphire Tower", "Crystal Cove", "Marina Bay Sands", "Palm Beach Resort"
        };

        // Типы номеров
        public static readonly string[] RoomTypes = {
            "Одиночный", "Для двоих", "Тройной", "Для молодых", "Люкс", "Семейный номер",
            "Студия", "Гранд люкс", "Президенский"
        };

        // Должности сотрудников
        public static readonly string[] Positions = {
        "Менеджер", "Администратор на ресепшене", "Уборщик номеров", "Шеф-повар", "Охранник", "Швейцар", "Работник технической поддержки",
        "Бариста", "Официант", "Бармен", "Координатор мероприятий", "Маркетинговый специалист", "Бухгалтер", "Менеджер по персоналу"
        };

        // Услуги отеля
        public static readonly string[] ServiceNames = {
            "Завтрак в номер", "Уборка номера", "Прачечная", "Трансфер до аэропорта", "Спа-процедуры", "Прокат автомобилей", "Экскурсии", "Конференц-зал",
            "Рум-сервис", "Доступ в спа-центр", "Тренажерный зал", "Бассейн", "Детская комната", "Доступ к Wi-Fi", "Парковка", "Хранение багажа"
        };

        // Описания услуг
        public static readonly string[] ServiceDescriptions = {
            "Доставка завтрака в номер", "Ежедневная уборка номера", "Профессиональная стирка и глажка одежды", "Бесплатный трансфер до аэропорта", "Массаж и спа-процедуры", "Прокат автомобилей премиум-класса", "Организация экскурсий по городу", "Аренда конференц-зала",
            "Доставка еды и напитков в номер", "Доступ к спа-центру с процедурами", "Тренажерный зал с современным оборудованием", "Открытый и закрытый бассейн", "Детская игровая комната", "Высокоскоростной доступ к Wi-Fi", "Охраняемая парковка", "Бесплатное хранение багажа"
        };

        // Методы оплаты
        public static readonly string[] PaymentMethods = {
            "Наличные", "Кредитная карта", "Дебитовая карта", "Альфа банк", "Apple Pay", "Google Pay",
            "Банковский трансфер", "Крипта", "Сбербанк", "Мобильный банк"
        };

        public static readonly string[] BookingStatuses = {
            "Подтверждено", "Отменено", "Завершено", "В ожидании",
            "Заселен", "Не явился", "Возвращено", "В процессе"
         };

    }
}